//------------------------------------------------------------------------------
//
//　個数を示す数値を入力し、その個数分だけ 0 ～ 9 の数字を表示する
//　プログラムを作成しなさい。数字は 0, 1, 2, 3, , の順に表示し、
//　9 の次は 0 に戻るものとします。
//
//------------------------------------------------------------------------------

public class rensyu4_11 {

	public static void main(String[] args){
		// 変数の宣言
		int i;
		int n;

		System.out.printf("整数を入力 ＞ ");
		n = new java.util.Scanner(System.in).nextInt();

		for(i = 0; i < n; i++) {
			System.out.printf("%d", i % 10);
		}
	}
}
