//------------------------------------------------------------------------------
//P.165
//　次の条件に合った各配列を準備するプログラムを作成してください。
//　なお、以下の４つの条件のコードを１つのプログラムの中に記述して構いません。
//　また、値の初期化は不要です。
//
//　①int型の値を４個まとめて格納できる配列points
//　②double型の値を５個まとめて格納できる配列weights
//　③boolean型の値を３つまとめて格納できる配列answers
//　④String型の値を３つまとめて格納できる配列names
//
//------------------------------------------------------------------------------

public class train1 {

	public static void main(String[] args){

		//①
		int points[4];

		//②
		double weights[5];

		//③
		boolean answers[3];

		//④
		String names[3];
	}
}
